Revit 2027 API
BuiltInFailures.GlobalParameterFailures.InvalidElementPropToGlobalParamLink Property
 The following parameters of the highlighted element can no longer be linked to global parameters: %1!s!.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidElementPropToGlobalParamLink { get; }
Public Shared ReadOnly Property InvalidElementPropToGlobalParamLink As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidElementPropToGlobalParamLink {
	FailureDefinitionId^ get ();
}
static member InvalidElementPropToGlobalParamLink : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GlobalParameterFailures Class
Autodesk.Revit.DB Namespace